In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_spss("1ResearchProjectData.sav")
data

     Student Teacher  Gender            Ethnic    Freeredu  Score       wesson
0        1.0   Ruger  Female             Asian  Free lunch   76.0  Ruger_Smith
1        2.0   Ruger  Female          Hispanic  Paid lunch   56.0  Ruger_Smith
2        3.0   Ruger  Female  African-American  Free lunch   34.0  Ruger_Smith
3        4.0   Ruger  Female             Asian  Paid lunch   59.0  Ruger_Smith
4        5.0   Ruger    Male          Hispanic  Free lunch   73.0  Ruger_Smith
..       ...     ...     ...               ...         ...    ...          ...
212    213.0  Wesson    Male          Hispanic  Free lunch   94.0       Wesson
213    214.0  Wesson    Male          Hispanic  Paid lunch   91.0       Wesson
214    215.0  Wesson  Female  African-American  Paid lunch   53.0       Wesson
215    216.0  Wesson    Male          Hispanic  Paid lunch   57.0       Wesson
216      NaN     NaN     NaN               NaN         NaN    NaN  Ruger_Smith

[217 rows x 7 columns]

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 217 entries, 0 to 216
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Student   216 non-null    float64
 1   Teacher   216 non-null    category
 2   Gender    216 non-null    category
 3   Ethnic    216 non-null    category
 4   Freeredu  216 non-null    category
 5   Score     216 non-null    float64
 6   wesson    217 non-null    category
dtypes: category(5), float64(2)
memory usage: 5.3 KB

In [5]:
# Checking the number of missing values in each column
data.isna().sum()

Student     1
Teacher     1
Gender      1
Ethnic      1
Freeredu    1
Score       1
wesson      0
dtype: int64

In [35]:
# Drop all rows with missing values in the original dataFrame.
data.shape
data.dropna(inplace=True)

(216, 7)

In [36]:
data.head()

   Student Teacher  Gender            Ethnic    Freeredu  Score       wesson
0      1.0   Ruger  Female             Asian  Free lunch   76.0  Ruger_Smith
1      2.0   Ruger  Female          Hispanic  Paid lunch   56.0  Ruger_Smith
2      3.0   Ruger  Female  African-American  Free lunch   34.0  Ruger_Smith
3      4.0   Ruger  Female             Asian  Paid lunch   59.0  Ruger_Smith
4      5.0   Ruger    Male          Hispanic  Free lunch   73.0  Ruger_Smith

In [6]:
# Checking for duplicated values (rows).
data.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
212    False
213    False
214    False
215    False
216    False
Length: 217, dtype: bool

In [7]:
data['Teaching Method'] = data['wesson'].apply(lambda x: 'Standard' if 'Ruger_Smith' in x else 'Traditional')

In [8]:
data

,Student,Teacher,Gender,Ethnic,Freeredu,Score,wesson,Teaching Method
0,1.0,Ruger,Female,Asian,Free lunch,76.0,Ruger_Smith,Standard
1,2.0,Ruger,Female,Hispanic,Paid lunch,56.0,Ruger_Smith,Standard
2,3.0,Ruger,Female,African-American,Free lunch,34.0,Ruger_Smith,Standard
3,4.0,Ruger,Female,Asian,Paid lunch,59.0,Ruger_Smith,Standard
4,5.0,Ruger,Male,Hispanic,Free lunch,73.0,Ruger_Smith,Standard
...,...,...,...,...,...,...,...,...
212,213.0,Wesson,Male,Hispanic,Free lunch,94.0,Wesson,Traditional
213,214.0,Wesson,Male,Hispanic,Paid lunch,91.0,Wesson,Traditional
214,215.0,Wesson,Female,African-American,Paid lunch,53.0,Wesson,Traditional
215,216.0,Wesson,Male,Hispanic,Paid lunch,57.0,Wesson,Traditional
216,NaN,NaN,NaN,NaN,NaN,NaN,Ruger_Smith,Standard

In [39]:
data.shape

(216, 8)

## TOTAL and MEAN SCORES

In [10]:
# Checking for the total score of the dataset.
total_score = data['Score'].sum()
total_score

14099.0

In [12]:
# Checking for the mean score of the dataset.
mean_score = data['Score'].mean()
round(mean_score, 2)

65.27

#### Total and Mean (Average) Score of Students under the Traditional Teaching Method.

In [14]:
traditional_method_score = data[data['Teaching Method'] == 'Traditional']['Score']

In [15]:
traditional_method_total_score = traditional_method_score.sum()
traditional_method_total_score

5372.0

In [16]:
traditional_method_mean_score = traditional_method_score.mean()
round(traditional_method_mean_score, 2)

70.68

#### Total and Mean (Average) Score of Students under the Standard Teaching Method.

In [17]:
standard_method_score = data[data['Teaching Method'] == 'Standard']['Score']

In [18]:
standard_method_total_score = standard_method_score.sum()
standard_method_total_score

8727.0

In [19]:
standard_method_mean_score = standard_method_score.mean()
round(standard_method_mean_score, 2)

62.34

### Summary
In conclusion, the Traditional method yielded the greatest result among students.

It is therefore important that all teachers adopt the Traditional method of teaching maths.